# Load Data

In [2]:
%load_ext sql
%sql sqlite:///CourseData.db

'Connected: @CourseData.db'

# Data Integrity

##### Test our tables using basic query knowledhe from earler in the course.

In [3]:
%%sql
SELECT *
FROM SECTIONS
Limit 5

;

 * sqlite:///CourseData.db
Done.

[(1, 'AC 0011', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", 'Michael P.  Coyne', 'Introduction to Financial Accounting', 'Fall2014', 31, -31, 0, 70384, 'C01'),
 (2, 'AC 0011', "[{'days': 'TF', 'times': '0930am-1045am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", 'Michael P.  Coyne', 'Introduction to Financial Accounting', 'Fall2014', 31, -31, 0, 70385, 'C02'),
 (3, 'AC 0011', "[{'days': 'TF', 'times': '1230pm-0145pm', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", 'Michael P.  Coyne', 'Introduction to Financial Accounting', 'Fall2014', 31, -31, 0, 70382, 'C03'),
 (4, 'AC 0011', "[{'days': 'MR', 'times': '1100am-1215pm', 'dates': '09/02-12/08', 'location': 'DSB 111'}]", 'Rebecca I.  Bloch', 'Introduction to Financial Accounting', 'Fall2014', 29, -29, 0, 70291, 'C04'),
 (5, 'AC 0011', "[{'days': 'MR', 'times': '1230pm-0145pm', 'dates': '09/02-12/08', 'location': 'DSB 111'}]", 'Rebecca I.  Bloch', 'Introduction to Financial Accounting', 'Fall2014', 30, -30, 0, 70350, 'C05')]

# Data Duplicity

#### Using queries to find duplicates and redundancies in the datasets

In [6]:
SELECT * 
FROM COURSES, INSTRUCTORS
JOIN( Catalog_ID, primary_instructor)
FROM users

;

SyntaxError: invalid syntax (<ipython-input-6-ec684a49e669>, line 1)